In [1]:
import numpy as np
import pandas as pd

In [2]:
titanic = pd.read_csv("https://raw.githubusercontent.com/dphi-official/Datasets/master/titanic_data.csv")

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# EDA

In [7]:
print("Total number of passengers = ", len(titanic))
print("Number of passengers who survived = ", len(titanic[titanic["Survived"] == 1]))

Total number of passengers =  891
Number of passengers who survived =  342

In [8]:
print("% of men who survived = ", 100*np.mean(titanic["Survived"][titanic["Sex"] == "male"]))
print("% of women who survived = ", 100*np.mean(titanic["Survived"][titanic["Sex"] == "female"]))

% of men who survived =  18.890814558058924
% of women who survived =  74.20382165605095

In [9]:
print("% of passengers who survived in first class = ", 100*np.mean(titanic["Survived"][titanic["Pclass"] == 1]))
print("% of passengers who survived in third class = ", 100*np.mean(titanic["Survived"][titanic["Pclass"] == 3]))

% of passengers who survived in first class =  62.96296296296296
% of passengers who survived in third class =  24.236252545824847

In [10]:
print("% of children who survived = ", 100*np.mean(titanic["Survived"][titanic["Age"] < 18]))
print("% of adults who survived = ", 100*np.mean(titanic["Survived"][titanic["Age"] > 18]))

% of children who survived =  53.98230088495575
% of adults who survived =  38.26086956521739

# Data pre-processing
### Non-numeric features to numeric

In [54]:
nums = { "Sex" : {"male": 1, "female": 2},
         "Embarked" : {"S": 1, "C": 2, "Q": 3}}
titanic = titanic.replace(nums)
titanic

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,0,22.000000,1,0,7.2500,1
1,2,1,1,0,38.000000,1,0,71.2833,2
2,3,1,3,0,26.000000,0,0,7.9250,1
3,4,1,1,0,35.000000,1,0,53.1000,1
4,5,0,3,0,35.000000,0,0,8.0500,1
...,...,...,...,...,...,...,...,...,...
886,887,0,2,0,27.000000,0,0,13.0000,1
887,888,1,1,0,19.000000,0,0,30.0000,1
888,889,0,3,0,29.699118,1,2,23.4500,1
889,890,1,1,0,26.000000,0,0,30.0000,2
890,891,0,3,0,32.000000,0,0,7.7500,3

### Missing values

In [15]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [16]:
titanic["Age"] = titanic["Age"].fillna(np.mean(titanic["Age"]))

In [55]:
# Looking at frequency of each values in Embarked
titanic.Embarked.value_counts()

1    646
2    168
3     77
Name: Embarked, dtype: int64

In [48]:
# Filling missing values in Embarked
titanic.Embarked.fillna(value = "S", axis = 0, inplace = True)

In [51]:
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

### Omit irrelevant columns

In [49]:
titanic = titanic.drop("Name", axis = 1)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,0,22.000000,1,0,7.2500,S
1,2,1,1,0,38.000000,1,0,71.2833,C
2,3,1,3,0,26.000000,0,0,7.9250,S
3,4,1,1,0,35.000000,1,0,53.1000,S
4,5,0,3,0,35.000000,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,887,0,2,0,27.000000,0,0,13.0000,S
887,888,1,1,0,19.000000,0,0,30.0000,S
888,889,0,3,0,29.699118,1,2,23.4500,S
889,890,1,1,0,26.000000,0,0,30.0000,C
890,891,0,3,0,32.000000,0,0,7.7500,Q

### Separating input variables X and target variable y

In [56]:
X = titanic.drop(["Survived"], axis = 1)
y = titanic["Survived"]

### Train and Test Split

In [57]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.33, random_state = 42)      # test size means 33% test data rest train data
# random state helps in getting the same data values on splitting provided one uses the same random state as provided earlier(in this case 42)

### Building ML Model

In [59]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()
model.fit(X_train, y_train)
# Decisiontreeclassifier does not take cat. data hence we converted sex and embarked to num. data

DecisionTreeClassifier()

### Evaluate model

In [60]:
!pip install graphviz

Collecting graphviz
  Downloading graphviz-0.20-py3-none-any.whl (46 kB)
Installing collected packages: graphviz
Successfully installed graphviz-0.20

In [61]:
from sklearn.metrics import accuracy_score
print("Training accuracy = ", accuracy_score(y_train, model.predict(X_train)))
print("Test accuracy = ", accuracy_score(y_test, model.predict(X_test)))

Training accuracy =  1.0
Validation accuracy =  0.6644067796610169

### Improve the model

In [62]:
model_improved = DecisionTreeClassifier(max_depth = 3)
model_improved.fit(X_train, y_train)

DecisionTreeClassifier(max_depth=3)

In [63]:
print("Train score = ", accuracy_score(y_train, model_improved.predict(X_train)))
print("Test score = ", accuracy_score(y_test, model_improved.predict(X_test)))

Train score =  0.7332214765100671
Test score =  0.711864406779661